'''Повернемося до попереднього завдання. У змінній rate у нас знаходиться тариф за електроенергію — 1.68.
Але тепер нам потрібно вести розрахунок денного та нічного тарифу. Нічний тариф розраховується
як половина денного, тобто. rate треба поділити на 2. У змінній value_day — денні показання лічильника,
а в змінній value_night — нічні. Знову ж таки, задайте для них розумне ціле число кіловат.
Розрахуйте та помістіть у змінну payment рахунок за електрику, але вже з урахуванням денного та нічного тарифів.'''


'''
rate = 1.68
value_day =
value_night =
payment =
'''

rate = 1.68
value_day = 100
value_night = 200
payment = rate * value_day + rate / 2 * value_night