'''Для закріплення матеріалу напишіть функцію find_all_words, яка шукає збіг слова в тексті. Функція повертає
список всіх знаходжень слова в параметрі word в тексті у вигляді будь-якого написання, тобто, наприклад, можливі
варіанти написання слова "Python" як pYthoN, pythOn, PYTHOn і т.і. головне, щоб зберігався порядок слів, регістр
не має значення.

Підказка: функції модуля re приймають ще ключовий параметр flags і ми можемо визначити нечутливість до регістру,
надавши йому значення re.IGNORECASE'''

'''
import re

def find_all_words(text, word):
'''


import re


def find_all_words(text, word):
    listt = re.findall(word, text, re.IGNORECASE)
       
    return listt

text = 'Якщо вихідні слова говорити менш виХідні слова формально, то поле заміни вихіДні слова може починатися з field_name, яке визначає об’єкт, значення якого має бути відформатовано та вставлено у вихідні слова дані замість поля заміни. За field_name необов’язково йде вихідні слова поле conversion, якому передує знак оклику'
word = "вихідні слова"
print(find_all_words(text, word))