'''Як ми знаємо, ключ у словнику має бути унікальним, тоді як значення його ні.
Реалізуйте функцію lookup_key для пошуку всіх ключів за значенням у словнику.
Першим параметром у функцію ми передаємо словник, а другим — значення, що хочемо знайти. Таким чином,
результат може бути як список ключів, так і порожній список, якщо ми нічого не знайдемо.'''

'''
def lookup_key(data, value):
'''

def lookup_key(data, value):
    empty_list = []
    for k, v in data.items():
        if v != value:
            continue
        else:
             empty_list.append(k)
    return empty_list
    