'''У нас є список показників студентів групи – це список з отриманими балами з тестування. Необхідно поділити список 
на дві частини. Напишіть функцію split_list, яка приймає список (цілі числа), знаходить середнє значення бала у списку та ділить
його на два списки. У перший потрапляють значення менше середнього, включаючи середнє значення, тоді як у другий — строго більше
від середнього. Функція повертає кортеж цих двох списків. Для порожнього списку повертаємо два порожні списки.'''


'''
def split_list(grade):
'''

def split_list(grade):
    apper_list = []
    down_list = []
    cort = (down_list, apper_list)
    z = len(grade)
    sum = 0
    for i in grade:
        sum = sum + i
    if z==0:
        return cort
    else:
        ser = (sum/z)
    for i in grade:
        if i > ser:
            apper_list.append(i)
        else:
            down_list.append(i)
    return cort
    