'''Всім відомо, що для доступу до кредитної картки банку потрібний пін-код. Класично склалося, що це поєднання чотири цифри.
Нам необхідно вирішити наступне програмістське завдання. Є підготовлений перелік пін-кодів. Напишіть функцію is_valid_pin_codes,
яка буде приймати як параметр список цих пін-кодів — рядок з чотирьох цифр і повертати логічне значення — валідний список чи ні.
Переконайтеся, що серед цих пін-кодів у списку не буде дублікатів, всі вони зберігаються у вигляді рядків, їх довжина
дорівнює 4 символам і містять вони тільки цифри.

Приклад аргументу для функції is_valid_pin_codes:

['1101', '9034', '0011']

Якщо список відповідає всім поставленим умовам, функція повертає логічне значення True. Якщо хоч одну з умов порушено, повертається
значення — False. Передбачити перевірку на порожній список в аргументі функції та повернути при цьому значення False.'''

'''
def is_valid_pin_codes(pin_codes):
'''

def is_valid_pin_codes(pin_codes):
    analis = list(set(pin_codes))
    numers = ['0', '1', '2', '3', '4', '5', '6', '7', '8', '9']
    autor = None
    if len(pin_codes) == len(analis):
        if len(pin_codes) >= 1:
            for pin in pin_codes:
                if pin == str(pin):
                    if len(pin) == 4:
                        for i in pin:
                            if i in numers:
                                autor = True
                            else:
                                autor = False
                    else:
                        autor = False
                else:
                    autor = False
        else:
            autor = False
    else:
        autor = False
    return autor
        