'''Ми проводимо розіграш призів серед перших 50 підписників ютуб-каналу. Ми маємо 7 призів для розіграшу. Може виникнути питання,
скільки різних списків переможців ми можемо отримати під час розіграшу? Для цього ми будемо використовувати формулу сполучень без
повторень

Cnk = n! / ((n - k)! · k!)

де n — це загальна кількість людей (випадків), а k — кількість людей, які отримали призи.

Напишіть функцію number_of_groups, яка приймає параметри n та k, і за допомогою функції factorial повертає нам скільки різних
списків переможців ми можемо отримати при розіграші

Зверніть увагу на те, які великі значення ми отримуємо для факторіала. Рекурсивні висловлювання треба завжди застосовувати
з обережністю при обчисленнях, щоб не отримати переповнення пам'яті.'''


'''
def factorial(n):
    
        
    
        


def number_of_groups(n, k):
'''

def factorial(n):
    return 1 if n < 2 else n * factorial(n - 1)
def number_of_groups(n, k):
    result = int(factorial(n) / (factorial(n - k) * factorial(k)))
    return result